# 0. Вывести квадрат числа
# Мое решение:
a = int(input('Введите число: '))
b = a * a
print('Квадрат числа равен:', b)

# Решение преподавателя:
number = int(input('Введите число: '))
print('Квадрат числа {} равен {}'.format(number, number**2))
print(f'Квадрат числа {number} равен {number**2}')
print('Квадрат числа', number, 'равен', number**2)